zsh-utilities.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Zsh Utilities</title>
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Xavier Garrido" />
<link rel="stylesheet" href="css/styles.css" />
               <link rel="stylesheet" href="css/org-pygments.css" />
               <link rel="stylesheet" href="//netdna.bootstrapcdn.com/font-awesome/4.1.0/css/font-awesome.min.css" />
</head>
<body onload="randomLinkColor();displayTOC();"><div id="toc"></div>
<div id="preamble" class="status">
 <a href="https://github.com/xgarrido/zsh-utilities"><i class="fa fa-github"></i></a><br/> 
</div>
<div id="content">
<h1 class="title">Zsh Utilities</h1>

<div id="outline-container-unnumbered-1" class="outline-2">
<h2 id="unnumbered-1">Introduction</h2>
<div class="outline-text-2" id="text-unnumbered-1">
<p>
This sould provides a saner set of default functions and/or aliases for <code>zsh</code>
shell. It includes
</p>
<ul class="org-ul">
<li>many useful libraries and configurations
</li>
<li>"literate" customization embedded in Org-mode files
</li>
</ul>

<p>
The latest version is at <a href="http://github.com/xgarrido/zsh-utilities">http://github.com/xgarrido/zsh-utilities</a>
</p>
</div>
</div>

<div id="outline-container-unnumbered-2" class="outline-2">
<h2 id="unnumbered-2">Installation</h2>
<div class="outline-text-2" id="text-unnumbered-2">
<p>
There are different way to install this plugin :
</p>
</div>
<div id="outline-container-unnumbered-3" class="outline-3">
<h3 id="unnumbered-3">In your <code>~/.zshrc</code></h3>
<div class="outline-text-3" id="text-unnumbered-3">
<ol class="org-ol">
<li><p>
Download the script or clone this repository:
</p>
<div class="org-src-container">

<pre class="src src-sh">git clone git://github.com/xgarrido/zsh-utilities.git
</pre>
</div>
</li>

<li><p>
Source this script <b>at the end</b> of <code>~/.zshrc</code>:
</p>
<div class="org-src-container">

<pre class="src src-sh"><span class="org-builtin">source</span> /path/to/zsh-utilities/init.zsh
</pre>
</div>
</li>

<li><p>
Source <code>~/.zshrc</code> to take changes into account:
</p>
<div class="org-src-container">

<pre class="src src-sh"><span class="org-builtin">source</span> ~/.zshrc
</pre>
</div>
</li>
</ol>
</div>
</div>

<div id="outline-container-unnumbered-4" class="outline-3">
<h3 id="unnumbered-4">With oh-my-zsh</h3>
<div class="outline-text-3" id="text-unnumbered-4">
<ol class="org-ol">
<li><p>
Download the script or clone this repository in <a href="http://github.com/robbyrussell/oh-my-zsh">oh-my-zsh</a> plugins directory:
</p>
<div class="org-src-container">

<pre class="src src-sh"><span class="org-builtin">cd</span> ~/.oh-my-zsh/custom/plugins
git clone git://github.com/xgarrido/zsh-utilities.git
</pre>
</div>
</li>

<li><p>
Activate the plugin in <code>~/.zshrc</code> (in <b>last</b> position)
</p>
<div class="org-src-container">

<pre class="src src-sh"><span class="org-variable-name">plugins</span>=( [plugins...] zsh-utilities)
</pre>
</div>
</li>

<li><p>
Source <code>~/.zshrc</code> to take changes into account:
</p>
<div class="org-src-container">

<pre class="src src-sh"><span class="org-builtin">source</span> ~/.zshrc
</pre>
</div>
</li>
</ol>
</div>
</div>

<div id="outline-container-unnumbered-5" class="outline-3">
<h3 id="unnumbered-5">With <a href="https://github.com/zsh-users/antigen">antigen</a> (recommended way)</h3>
<div class="outline-text-3" id="text-unnumbered-5">
<p>
Add the following line into your <code>~/.zshrc</code> file:
</p>
<div class="org-src-container">

<pre class="src src-sh">antigen-bundle xgarrido/zsh-utilities
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-unnumbered-6" class="outline-2">
<h2 id="unnumbered-6">Structure</h2>
<div class="outline-text-2" id="text-unnumbered-6">
<p>
This <code>zsh-utilities.org</code> file is where everything begins. It is loaded
automatically on <code>zsh</code> startup if you have well followed the <a href="#unnumbered-2">installation</a>
process. The sole purpose of this file is to load the shell code embedded in
it and goes on to load plugin files.
</p>
</div>
</div>

<div id="outline-container-unnumbered-7" class="outline-2">
<h2 id="unnumbered-7">Implementation</h2>
<div class="outline-text-2" id="text-unnumbered-7">
<p>
Besides the fact that <a href="http://orgmode.org/">org-mode</a> is used, this plugin does not use the org-babel
tangling features and thus, does not assume that emacs is properly installed and
set. All the tangling stuff is done through a simple <a href="Makefile">Makefile</a> and some <a href="http://www.gnu.org/software/sed/">sed</a>
tricks. In this way, it can be used without emacs. The only needed knowledge
about org-mode is the code wrapping that <b>must</b> be done using proper code blocks
calls (see <a href="http://orgmode.org/manual/Structure-of-code-blocks.html#Structure-of-code-blocks">org babel documentation</a>). Nevertheless, it is recommended to have a
look on org-mode features especially folding/unfolding abilities which make the
read and the navigation pretty easy.
</p>
</div>

<div id="outline-container-unnumbered-8" class="outline-3">
<h3 id="unnumbered-8">Core settings</h3>
<div class="outline-text-3" id="text-unnumbered-8">
<p>
The only "core" thing is to know where the files are.
</p>
<div class="org-src-container">

<pre class="src src-sh"><span class="org-variable-name">zsh_utilities_dir</span>=$(dirname $<span class="org-variable-name">0</span>)
</pre>
</div>
</div>
</div>

<div id="outline-container-unnumbered-9" class="outline-3">
<h3 id="unnumbered-9">Modules</h3>
<div class="outline-text-3" id="text-unnumbered-9">
<p>
Modules are defined in <a href="zsh-utilities-modules.html">zsh-utilities-modules</a> files. This file provides some
configuration for external resources.
</p>

<div class="org-src-container">

<pre class="src src-sh"><span class="org-builtin">source</span> ${<span class="org-variable-name">zsh_utilities_dir</span>}/zsh-utilities-modules.zsh
</pre>
</div>
</div>
</div>

<div id="outline-container-unnumbered-10" class="outline-3">
<h3 id="unnumbered-10">Load plugin files</h3>
<div class="outline-text-3" id="text-unnumbered-10">
<p>
The following files contain specific settings for several plugins. <b>Keep this
order</b> since there are some dependencies.
</p>

<ul class="org-ul">
<li><p>
Message handling and function facilities in <a href="zsh-utilities-pkgtools.html">zsh-utilities-pkgtools</a>
</p>
<div class="org-src-container">

<pre class="src src-sh"><span class="org-builtin">source</span> ${<span class="org-variable-name">zsh_utilities_dir</span>}/zsh-utilities-pkgtools.zsh
</pre>
</div>
</li>

<li><p>
Machine configuration in <a href="zsh-utilities-configure.html">zsh-utilities-configure</a>
</p>
<div class="org-src-container">

<pre class="src src-sh"><span class="org-builtin">source</span> ${<span class="org-variable-name">zsh_utilities_dir</span>}/zsh-utilities-configure.zsh
</pre>
</div>

<p>
After "sourcing", we must run the private function <code>__configure_machine</code> to
get defined environment variable related to local machine.
</p>
<div class="org-src-container">

<pre class="src src-sh">__configure_machine
</pre>
</div>
</li>

<li><p>
Some <code>zsh</code> default and custom settings in <a href="zsh-utilities-settings.html">zsh-utilities-settings</a>
</p>
<div class="org-src-container">

<pre class="src src-sh"><span class="org-builtin">source</span> ${<span class="org-variable-name">zsh_utilities_dir</span>}/zsh-utilities-settings.zsh
</pre>
</div>
</li>

<li><p>
Basic zsh functions in <a href="zsh-utilities-functions.html">zsh-utilities-functions</a>
</p>
<div class="org-src-container">

<pre class="src src-sh"><span class="org-builtin">source</span> ${<span class="org-variable-name">zsh_utilities_dir</span>}/zsh-utilities-functions.zsh
</pre>
</div>
</li>

<li><p>
Definition of some <code>shell</code> aliases in <a href="zsh-utilities-alias.html">zsh-utilities-alias</a>
</p>
<div class="org-src-container">

<pre class="src src-sh"><span class="org-builtin">source</span> ${<span class="org-variable-name">zsh_utilities_dir</span>}/zsh-utilities-alias.zsh
</pre>
</div>
</li>

<li><p>
Work (mainly SuperNEMO software) related functions in <a href="zsh-utilities-work.html">zsh-utilities-work</a>
</p>
<div class="org-src-container">

<pre class="src src-sh"><span class="org-builtin">source</span> ${<span class="org-variable-name">zsh_utilities_dir</span>}/zsh-utilities-work.zsh
</pre>
</div>
</li>
</ul>
</div>
</div>

<div id="outline-container-unnumbered-11" class="outline-3">
<h3 id="unnumbered-11">Custom plugins</h3>
<div class="outline-text-3" id="text-unnumbered-11">
<p>
If you want to add your plugins to the list you can <code>source</code> it here. This
section my change latter if a <code>custom</code> directory is one day provided.
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
File under <i class="fa fa-github-alt"></i> version control - commit <a href="https://github.com/xgarrido/zsh-utilities/commit/b7f7874ac2e22ead7c0cd912dec7d91f04df1951">b7f7874</a> - 2014-11-07
</div>
</body>
</html>
